Ran Plan for dir: `vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_firewall.atlantis_test_firewall will be updated in-place
~ resource "google_compute_firewall" "atlantis_test_firewall" {
        id                      = "projects/premium-guide-403909/global/firewalls/atlantis-test"
        name                    = "atlantis-test"
      ~ network                 = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-test-network" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_compute_network.vpc_network must be replaced
-/+ resource "google_compute_network" "vpc_network" {
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/premium-guide-403909/global/networks/atlantis-test-network" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
      ~ mtu                                       = 0 -> (known after apply)
      ~ name                                      = "atlantis-test-network" -> "atlantis-demo-network" # forces replacement
      ~ routing_mode                              = "REGIONAL" -> (known after apply)
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-test-network" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # google_compute_subnetwork.terraform_subnetwork must be replaced
-/+ resource "google_compute_subnetwork" "terraform_subnetwork" {
      ~ creation_timestamp         = "2023-11-12T12:44:55.294-08:00" -> (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.10.0.1" -> (known after apply)
      ~ id                         = "projects/premium-guide-403909/regions/europe-central2/subnetworks/atlantis-test-subnetwork" -> (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ipv6_cidr_range            = (known after apply)
      ~ name                       = "atlantis-test-subnetwork" -> "atlantis-demo-subnetwork" # forces replacement
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/global/networks/atlantis-test-network" # forces replacement -> (known after apply) # forces replacement
      ~ private_ip_google_access   = false -> (known after apply)
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/premium-guide-403909/regions/europe-central2/subnetworks/atlantis-test-subnetwork" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.118.115.250/lock?id=devabolmasov%252Fatlantis%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc`
</details>
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`